package Tree1.Person;
public enum Relations {
    /**
     * Relation класс ENUM, для описания вида родственных связей.
     * Так как родственная связь - понятие определенное, то формируем справочник, исключая возможность ошибки ввода
     */
    ОТЕЦ,
    ОТЧИМ,
    МАМА,
    МАЧЕХА,
    БАБУШКА,
    ДЕДУШКА,
    ПРАБАБУШКА,
    ПРАДЕДУШКА,
    СЫН,
    ПАСЫНОК,
    ДОЧЬ,
    ПАДЧЕРИЦА,
    БРАТ,
    СЕСТРА,
    ТЕТЯ,
    ПЛЕМЯНИК,
    ПЛЕМЯНИЦА,
    ДВОЮРОДНЫЙ_БРАТ,
    ВНУК,
    ВНУЧКА,
    МУЖ,
    ЖЕНА

}
